**`commonimages/base/rhel_7_9`** terragrunt plan on `pull_request` event [#645](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_ami.parent[0]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["stig-build-linux-medium"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["update-linux"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "shared rhel 7.9 base image"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:REDACTED:distribution-configuration/base-rhel-7-9"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:REDACTED:infrastructure-configuration/base-rhel-7-9-0-1-2"
      + name                             = "base_rhel_7_9"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "application"                     = "n/a"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.1.2"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.1.2"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2024.4.0"
          + "update-linux-version"            = "1.0.2"
        }
      + tags_all                         = {
          + "application"                     = "n/a"
          + "branch"                          = "main"
          + "business-unit"                   = "HMPPS"
          + "image-pipeline"                  = "base_rhel_7_9"
          + "image-recipe"                    = "base_rhel_7_9/0.1.2"
          + "infrastructure-configuration"    = "base_rhel_7_9/0.1.2"
          + "is-production"                   = "true"
          + "os-version"                      = "rhel 7.9"
          + "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                = "n/a"
          + "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          + "stig-build-linux-medium-version" = "2024.4.0"
          + "update-linux-version"            = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_ONLY"
          + schedule_expression                = "cron(0 0 1 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-recipe/base-rhel-7-9/0.1.2" -> (known after apply)
      ~ date_created     = "2024-01-23T09:50:18.412Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:REDACTED:image-recipe/base-rhel-7-9/0.1.2" -> (known after apply)
        name             = "base_rhel_7_9"
      ~ owner            = "374269020027" -> (known after apply)
      ~ parent_image     = "ami-0c2f9865057c3dfe1" -> "ami-0c1e9b4f894b82051" # forces replacement
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
            "application"                     = "n/a"
            "branch"                          = "main"
            "business-unit"                   = "HMPPS"
            "image-pipeline"                  = "base_rhel_7_9"
            "image-recipe"                    = "base_rhel_7_9/0.1.2"
            "infrastructure-configuration"    = "base_rhel_7_9/0.1.2"
            "is-production"                   = "true"
            "os-version"                      = "rhel 7.9"
            "owner"                           = "digital-studio-operations-team@digital.justice.gov.uk"
            "release-or-patch"                = "n/a"
            "source-code"                     = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/base/rhel_7_9"
          ~ "stig-build-linux-medium-version" = "2024.2.3" -> "2024.4.0"
            "update-linux-version"            = "1.0.2"
        }
      ~ tags_all         = {
          ~ "stig-build-linux-medium-version" = "2024.2.3" -> "2024.4.0"
            # (12 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:REDACTED:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"
          + no_device   = (known after apply)

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:REDACTED:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```
